testing/share/Testing/test_data/SimpleStatic_4/fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
//    default Euler;
}

gradSchemes
{
    default         none;
    grad(p) Gauss linear;
    snGradCorr(U) Gauss linear;
    grad(U) Gauss linear;
    snGradCorr(p) Gauss linear;
    snGradCorr(cellMotionU) Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)   Gauss skewCorrected linear;
//    div(phi,U)   Gauss upwind;
}

laplacianSchemes
{
    default         none;
    laplacian(nu,U) Gauss linear corrected;
    laplacian((1|A(U)),p) Gauss linear corrected;
    laplacian(diffusivity,cellMotionU) Gauss linear corrected;
}

interpolationSchemes
{
    default           none;
    interpolate(y) linear;
    interpolate(U) skewCorrected linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
