testing/share/Testing/test_data/SimpleStatic_4/fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

	p
	{
		solver          GAMG;
    		tolerance       1e-06;
    		relTol          0;
    		minIter         1;
    		maxIter         1000;
    		smoother        GaussSeidel;
    		nPreSweeps      0;
    		nPostSweeps     2;
    		nFinestSweeps   2;
    		scaleCorrection true;
    		directSolveCoarsest false;
    		cacheAgglomeration true;
    		nCellsInCoarsestLevel 20;
    		agglomerator    faceAreaPair;
    		mergeLevels     1;
	};

	cellMotionU
    	{
		solver          GAMG;
        	tolerance        1e-6;
        	relTol           1e-3;
        	minIter          1;
        	maxIter          1000;

        	smoother         GaussSeidel;
        	nPreSweeps       0;
        	nPostSweeps      2;
        	nFinestSweeps    2;
		
        	scaleCorrection true;
        	directSolveCoarsest false;
				   		
        	 cacheAgglomeration true;

		 nCellsInCoarsestLevel 20;
        	 agglomerator     faceAreaPair;
        	 mergeLevels      1;
        };

    	U
    	{
		solver PBiCG;
		preconditioner   DILU;
        	tolerance        1e-06;
        	relTol           0;
    	};
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors 50;
    ddtPhiCorr no;
}

// ************************************************************************* //
